Repository: share-extras/langpack-cy
Catalog: core/tmx/web-client.tmx
Source language: en_us
Languages: cy

source: This operation will attempt to overwrite the existing saved search ''{0}''
cy: Bydd y gweithrediad yma yn ceisio i dros-ysgrifo'r chwiliad a gadwyd "{0}" sy'n bodoli eisoes

source: You have been logged out of Alfresco.
cy: Rydych wedi eich allgofnodi o Alfresco

source: Step Two - Author Web Content
cy: Cam Dau - Awduro Cynnwys Gwe

source: The User will no longer be able to access the documents and folders in this space. Are you sure you want to remove user "{0}"?
cy: Ni bydd y defnyddiwr yn gallu cyrchu'r dogfennau a ffolderau yn y lle yma bellach. A ydych chi'n siŵr eich bod eisiau tynnu'r defnyddiwr "{0}"?

source: Successfully changed Inherit Parent Permissions to 'No'
cy: Newidiwyd Etifeddu Caniatadau Rhiant i 'Nage' yn llwyddiannus

source: Add Content
cy: Ychwanegu Cynnwys

source: Next Item
cy: Eitem Nesaf

source: Add Multiple Files
cy: Ychwanegu Ffeiliau Lluosol

source: Generated Files
cy: Ffeiliau Wedi Cynhyrchu

source: Modify the permissions granted to a user for accessing your space.
cy: Newid y caniatadau sydd wedi wedi eu rhoi i ddefnyddiwr er mwyn gyrchu eich lle.

source: Are you sure you want to delete "{0}"?
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}"?

source: Save New Search
cy: Cadw Chwiliad Newydd

source: Selected Items
cy: Eitemau Dewiswyd

source: To update the rule click Finish. To review or change your selections click Back.
cy: I diweddaru'r rheol cliciwch Gorffen. I adolygu neu i newid eich dewisiadau cliciwch Nôl.

source: When
cy: Pan

source: Name property does not match ''{0}''
cy: Priodwedd enw dim yn cydweddu â "{0}"

source: Successfully deleted space ''{0}''.
cy: Wedi dileu y lle "{0}" yn llwyddiannus.

source: Successfully submitted item: {0}
cy: Cyflwynwyd yr eitem yn llwyddiannus: {0}

source: Set action values
cy: Gosod gwerthoedd gweithred

source: Starting Space
cy: Lle Cychwyn

source: Create From Existing Web Project
cy: Creu o Broject Gwe cyfredol

source: Move
cy: Symud

source: Edit Deployment Server Details
cy: Golygu Manylion Gweinydd Darpariaeth

source: Previous Page
cy: Tudalen Blaenorol

source: Browse items in sub-categories?
cy: Pori eitemau mewn is-gategorïau

source: {0} Static Files
cy: {0} Ffeiliau Sefydlog

source: Once the group is removed from the system it will no longer be accessable. Are you sure you want to delete Group "{0}" and remove all users from it?
cy: Ar ôl tynnu'r grŵp o'r system ni fydd o'n gyrchadwy. A ydych chi'n siŵr eich bod eisiau dileu'r grŵp "{0}" a thynnu pob defnyddiwr ohono?

source: Licensed: LICENSE INVALID - Alfresco Repository restricted to read-only capability.
cy: Trwyddedu: TRWYDDED ANNILYS - Repositori Alfresco wedi ei cyfyngu i modd darllen-yn-unig

source: Edit Group
cy: Golygu Grŵp

source: Unable to delete Folder due to system error:
cy: Methu dileu'r ffolder oherwydd gwall system:

source: Topic
cy: Pwnc

source: Invite Web Project Users
cy: Gwahodd Defnyddwyr Project Gwe

source: Manage System Users
cy: Rheoli Defnyddwyr System

source: Broken
cy: Toredig

source: The working copy is no longer available. This could be due to an active rule(s) applied to the space you checked-out to.
cy: Nid yw'r copi gweithio ar gael bellach. Gall hyn fod o achos rheolau gweithredol a gymhwyswyd i'r lle a gwiriwyd allan i.

source: Failed to reject the document due to system error: {0}
cy: Methwyd gwrthod y ddogfen oherwydd gwall system: {0}

source: Workflow
cy: Llif Gwaith

source: You may want to check out this file to lock it and prevent other users from editing it.
cy: Efallai byddwch eisiau gwirio allan y ffeil yma er mwyn cloi o ac atal defnyddwyr arall ei golygu.

source: Coordinator
cy: Cydgysylltwr

source: Expired Content For Review
cy: Cynnwys Darfodedig i Adolygu

source: Information
cy: Gwybodaeth

source: Version History
cy: Hanes Fersiwn

source: Release Test Server
cy: Rhyddhau Gweinydd Profi

source: Check the item does not match the criteria above
cy: Gwirio bod yr eitem dim yn cydweddu â'r amod uchod

source: Details of the deleted item
cy: Manylion yr eitem wedi'i dileu

source: Locate content to upload
cy: Lleoli'r cynnwys i lwytho i fyny

source: Select which renditions you want to regenerate.
cy: Dewis y lluniadau eich bod eisiau ail-gynhyrchu.

source: Upload
cy: Llwytho i Fyny

source: General
cy: Cyffredinol

source: Navigate to your home space. In the space info area, click Add Content and enter information about the content to be uploaded.
cy: Llywio i'ch lle cartref. Yn yr ardal gwybodaeth lle, cliciwch Ychwanegu Cynnwys a mewnbynnwch gwybodaeth am y gynnwys i lwytho i fyny.

source: Archive package
cy: Pecyn archif

source: More Actions for this Space
cy: Mwy o Gweithredoedd ar gyfer y Lle

source: Include sub-categories
cy: Cynnwys is-gategorïau

source: Please provide values for all required fields
cy: Darparwch gwerthoedd ar gyfer pob maes angenrheidiol

source: Specialise Type Action
cy: Gweithred Arbenigo Math

source: Choose icon
cy: Dewis eicon

source: Copies image to ''{0}'' and transforms to ''{1}'' using option ''{2}''
cy: Copïo cynnwys i "{0}" a thrawsffurfio i "{1}" gyda ddewisiad "{2}"

source: This space and all its contents. Note: Rules will also be deleted.
cy: Y lle yma a'i holl cynnwys. Nodyn: Bydd rheoli hefyd yn cael eu dileu.

source: Item is in category ''{0}''
cy: Eitem yn y categori "{0}"

source: Use copy in current space
cy: Defnyddiwch copi yn y lle cyfredol

source: Last 7 days
cy: Yr 7 diwrnod olaf

source: for ''{0}''
cy: ar gyfer "{0}"

source: Review Due Date
cy: Dyddiad Disgwyliedig Adolygiad

source: New Search
cy: Chwiliad Newydd

source: New Edition from this
cy: Argraffiad Newydd o hyn

source: Automatic text
cy: Testun awtomatig

source: Failed to execute export: {0}
cy: Methwyd gweithredu'r allforyn: {0}

source: The wizard has successfully created the content and all renditions.
cy: Mae'r dewin wedi creu y cynnwys a phob lluniad yn llwyddiannus.

source: View details about the forum.
cy: Gweld manylion am y fforwm.

source: An existing space
cy: Lle Cyfredol

source: List of active tasks still to complete
cy: Rhestr o tasgau gweithredol sydd dal i gwblhau

source: Created By
cy: Crëwyd Gan

source: Step Three - Configure Workflow
cy: Cam Tri - Ffurfweddu Llif Gwaith

source: Unable to find form {0} in web project {1} associated with {2}.
cy: Methu canfod y ffurflen {0} yn y project gwe {1} sydd wedi'i cysylltu gyda {2}.

source: Copy To Web Project Action
cy: Gweithred Copïo i Broject Gwe

source: Select Condition
cy: Dewis Amod

source: Create Web Form
cy: Creu Ffurflen Gwe

source: Clear Results
cy: Clirio Canlyniadau

source: Step Six - Add Users
cy: Cam Chwech - Ychwanegu Defnyddwyr

source: Click to set values and add to list
cy: Cliciwch i osod gwerthoedd ac ychwanegu i'r rhestr

source: Status
cy: Statws

source: Step One - Author Web Content
cy: Cam Un - Awduro Cynnwys Gwe

source: Step one, select the starting item from the list of translations
cy: Cam un, dewiswch yr eitem cychwyn o'r rhestr cyfieithiadau

source: Remove Invited User
cy: Tynnu Defnyddiwr Gwahoddedig

source: Check out content to ''{0}''
cy: Gwirio allan cynnwys i "{0}"

source: Link to
cy: Cysylltu â

source: This view allows you to browse posts in this topic.
cy: Mae'r golwg yma yn gadael i chi pori pyst yn y pwnc yma.

source: Unable to delete Sandbox due to system error:
cy: Methu dileu'r Blwch Tywod oherwydd gwall system:

source: Unable to check out Content Node due to system error:
cy: Methu gwirio allan y Nôd Cynnwys oherwydd gwall system:

source: Please correct the errors below then click Reply.
cy: Cywirwch y wallau isod a chliciwch Ateb, os gwelwch yn dda.

source: Clear Search Results
cy: Clirio Canlyniadau Chwiliad

source: To create the forum space click Create Forum Space.
cy: I greu'r lle fforwm cliciwch Creu Lle Fforwm.

source: Preview Contents
cy: Rhagolygu Cynnwys

source: Existing Space
cy: Lle Cyfredol

source: Reassign
cy: Ail-Neilltuo

source: Modifier
cy: Newidiwr

source: Deployment details cannot be found, this is probably because the deployment is still progressing, refresh this page until details appear.
cy: Methu canfod manylion darpariaeth, mwy na thebyg oherwydd bod y darpariaeth dal yn gweithredu. Ail-lwythwch y dudalen yma tan ymddangosir y manylion.

source: Workflows
cy: Llifiau Gwaith

source: Enter Content
cy: Mewnbynnu Cynnwys

source: Space Details
cy: Manylion Lle

source: Modified
cy: Newidiwyd

source: Actions
cy: Gweithredoedd

source: Files and folders within this space.
cy: Ffeiliau a ffolderau yn y lle yma.

source: Reapply Rules In Space
cy: Ailweithredu Rheolau Mewn Lle

source: Enter the new password for this user.
cy: Mewnbynnwch y cyfrinair newydd ar gyfer y defnyddiwr yma

source: Add a translation without content to the document
cy: Ychwanegu cyfieithiad heb gynnwys i'r dogfen

source: Content Publisher
cy: Cyhoeddwr Cynnwys

source: {0} {0,choice,0#renditions|1#rendition|1<renditions} have been regenerated in web project {1}.
cy: Mae {0} {0,choice,0#lluniadau|1#lluniad|1<lluniadau} wedi ei ail-gynhyrchu yn y project gwe {1}.

source: Comment
cy: Sylw

source: Selected email recipients
cy: Derbynwyr e-bost dewiswyd

source: Are you sure you want to delete "{0}" and all its posts?
cy: A ydych chi'n siŵr eich bod eisiau dileu "{0}" a'i holl hysbysiadau?

source: In Progress
cy: Ar Waith

source: Regenerated all renditions in web project {0}.
cy: Wedi ail-gynhyrchu pob lluniad yn y project gwe {0}.

source: Successfully updated space ''{0}''.
cy: Newidiwyd y lle "{0}" yn llwyddiannus.

source: Add New
cy: Ychwanegu Un Newydd

source: Allocated
cy: Dyrannwyd

source: Modify all properties when this page closes.
cy: Newid pob priodwedd pan fo'r tudalen yma yn cau.

source: Search for email recipients by Name or Group
cy: Chwilio am derbynwyr e-bost drwy enw neu grŵp

source: Insert Template
cy: Mewnosod Templed

source: Use this view to change your user details and email address
cy: Defnyddiwch yr olwg yma i newid eich manylion personol

source: How do you want to create your space?
cy: Sut hoffech chi greu eich lle?

source: No content awaiting launch
cy: Dim cynnwys yn disgwyl lansiad

source: Licensed: {0} license granted to {1} and does not expire (issued on {2,date,short}).
cy: Trwyddedu: Trwydded {0} wedi ei addef i {1} a ddim yn cyfyngu (wedi ei dyroddi ar {2,date,short})

source: Note: Only those Web Projects marked for use as a template will be displayed by default.
cy: Nodyn: Dim ond y Cyweithiau Gwe a marciwyd fel templed fydd yn cael eu ddangos yn rhagosodedig.

source: Live Server
cy: Gweinydd Fyw

source: Rule Type
cy: Math Rheol

source: View Link Validation Report
cy: Gweld Adroddiad Dilysu Cysylltiadau

source: Target
cy: Targed

source: Space Properties
cy: Priodweddau Lle

source: Enter information about the web form you want to create.
cy: Mewnbynnwch gwybodaeth am y ffurflen gwe a ydych eisiau creu.

source: Manage Deleted Items
cy: Rheoli Eitemau wedi'u Dileu

source: Recover the listed files and spaces from the deleted file store
cy: Adfer y ffeiliau a lleoedd rhestredig o'r stôr ffeiliau wedi'u dileu?

source: Version Notes
cy: Nodiadau Fersiwn

source: Start Location
cy: Lle Cychwyn

source: First Page
cy: Tudalen Gyntaf

source: Structure
cy: Strwythur

source: To create the reply click Reply.
cy: I creu'r ateb cliciwch Ateb.

source: Edit the properties of the file then click OK.
cy: Golygwch priodweddau'r ffeil a chliciwch Iawn.

source: No modified items
cy: Dim newidiadau

source: Edit HTML File Inline
cy: Golygu Ffeil HTML Mewn-lein

source: This document is not inline editable.
cy: Nid yw'r dogfen yn golygadwy mewn-lein.

source: Enter your document content into the repository.
cy: Mewnbynnwch cynnwys eich dogfen.

source: View details about the topic.
cy: Gweld manylion am y pwnc.

source: Make Multilingual
cy: Gwneud Amlieithog

source: Please correct the export errors below then click OK.
cy: Cywirwch y wallau allforio isod a chliciwch Iawn, os gwelwch yn dda.

source: Error with workflow filename pattern: {0}
cy: Gwall hefo patrwm enw ffeil llif gwaith: {0}

source: Modify Space Properties
cy: Newid Priodweddau Lle

source: Modify the space properties then click OK.
cy: Newidiwch priodweddau y lle, a chliciwch Iawn.

source: Configure Deployment Servers
cy: Ffurfweddu Gweinyddion Darpariaeth

source: Enter new content.
cy: Mewnbynnwch cynnwys newydd

source: Idle
cy: Segur

source: Deploy
cy: Darparu

source: Selected Rule Conditions
cy: Amodau Rheol Dewiswyd

source: Provide details of the File System Receiver to add
cy: Darparu manylion y Derbyniwr System Ffeil i ychwanegu

source: Failed to recover the item "{0}" as the parent folder is missing, please select a new folder destination.
cy: Methwyd adfer yr eitem "{0}" gan fod y ffolder rhiant ar goll. Dewiswch cyrchfan arall, os gwelwch y dda.

source: Invite User
cy: Gwahodd Defnyddiwr

source: Reviewers
cy: Adolygwyr

source: Filename pattern
cy: Patrwm enw ffeil

source: Expiration Date
cy: Dyddiad Darfod

source: This wizard helps you create a new web project space.
cy: Mae'r dewin yma yn eich cynorthwyo i greu lle project gwe newydd.

source: Step One - Select Conditions
cy: Cam Un - Dewiswch Amodau

source: Reject Flow
cy: Llif Gwrthod

source: Created
cy: Creu

source: File names only
cy: Enwau ffeil yn unig

source: Note: Any content rules for spaces will also be copied.
cy: Nodyn: Bydd unrhyw rheolau cynnwys ar gyfer lleoedd hefyd yn cael eu gopïo.

source: Enter information about this person.
cy: Mewnbynnwch gwybodaeth am y person yma.

source: Add Alfresco Server Receiver (ASR)
cy: Ychwanegu Derbyniwr Gweinydd Alfresco (ASR)

source: Apply rule to sub spaces
cy: Gosod rheol ar is-lleoedd

source: Select a template to be applied to the Document as a Custom view.
cy: Dewiswch templed i rhoi i'r ddogfen fel golwg addasiedig.

source: Available translations
cy: Cyfieithiadau ar gael

source: Browse Website
cy: Pori Safle Gwe

source: Edit
cy: Golygu

source: Category Management
cy: Rheolaeth Categorïau

source: Select a condition...
cy: Dewis amod...

source: Guest Home
cy: Cartref Gwestai

source: Failed to approve the document due to system error: {0}
cy: Methwyd cymeradwyo'r dogfen oherwydd gwall system: {0}

source: Uploaded Content
cy: Cynnwys a Lwythwyd i Fyny

source: Are you sure you want to recover "{0}" from the deleted file store?
cy: A ydych chi'n siŵr eich bod eisiau adfer "{0}" o'r stôr ffeiliau wedi'u dileu?

source: Edit Web Form
cy: Golygu Ffurflen Gwe

source: Working Copy
cy: Copi Gweithio

source: Start {0} Workflow Wizard
cy: Dewin Cychwyn Llif Gwaith {0}

source: User ''{0}'' is the current owner of this content.
cy: Defnyddiwr "{0}" yw perchennog presennol y cynnwys yma.
